ahtn/keyplus/efm8/efm8/mcu/C8051F800/inc/SI_C8051F800_Register_Enums.h
//------------------------------------------------------------------------------
// Copyright 2014 Silicon Laboratories, Inc.
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v11/Silicon_Labs_Software_License_Agreement.txt
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//Supported Devices:
//  C8051F800_GM
//  C8051F800_GU
//  C8051F801_GM
//  C8051F801_GU
//  C8051F802_GM
//  C8051F802_GU
//  C8051F803_GS
//  C8051F804_GS
//  C8051F805_GS
//  C8051F806_GM
//  C8051F806_GU
//  C8051F807_GM
//  C8051F807_GU
//  C8051F808_GM
//  C8051F808_GU
//  C8051F809_GS
//  C8051F810_GS
//  C8051F811_GS
//  C8051F812_GM
//  C8051F812_GU
//  C8051F813_GM
//  C8051F813_GU
//  C8051F814_GM
//  C8051F814_GU
//  C8051F815_GS
//  C8051F816_GS
//  C8051F817_GS
//  C8051F818_GM
//  C8051F818_GU
//  C8051F819_GM
//  C8051F819_GU
//  C8051F820_GM
//  C8051F820_GU
//  C8051F821_GS
//  C8051F822_GS
//  C8051F823_GS
//  C8051F824_GS
//  C8051F825_GS
//  C8051F826_GS
//  C8051F827_GS
//  C8051F828_GS
//  C8051F829_GS
//  C8051F830_GS
//  C8051F831_GS
//  C8051F832_GS
//  C8051F833_GS
//  C8051F834_GS
//  C8051F835_GS

#ifndef SI_C8051F800_REGISTER_ENUMS_H
#define SI_C8051F800_REGISTER_ENUMS_H

//Standard device includes
#include "SI_C8051F800_Defs.h"
//------------------------------------------------------------------------------
// ADC0CF Enums (ADC0 Configuration @ 0xBC)
//------------------------------------------------------------------------------
#define ADC0CF_AMP0GN__BMASK           0x01 ///< Gain Control                                    
#define ADC0CF_AMP0GN__SHIFT           0x00 ///< Gain Control                                    
#define ADC0CF_AMP0GN__GAIN_0P5        0x00 ///< The on-chip PGA gain is 0.5.                    
#define ADC0CF_AMP0GN__GAIN_1          0x01 ///< The on-chip PGA gain is 1.                      
                                                                                                 
#define ADC0CF_AD8BE__BMASK            0x02 ///< 8-Bit Mode Enable                               
#define ADC0CF_AD8BE__SHIFT            0x01 ///< 8-Bit Mode Enable                               
#define ADC0CF_AD8BE__NORMAL           0x00 ///< ADC0 operates in 10-bit mode (normal operation).
#define ADC0CF_AD8BE__8_BIT            0x02 ///< ADC0 operates in 8-bit mode.                    
                                                                                                 
#define ADC0CF_ADLJST__BMASK           0x04 ///< ADC0 Left Justify Select                        
#define ADC0CF_ADLJST__SHIFT           0x02 ///< ADC0 Left Justify Select                        
#define ADC0CF_ADLJST__RIGHT_JUSTIFIED 0x00 ///< Data in the ADC0H:ADC0L registers is right-     
                                            ///< justified.                                      
#define ADC0CF_ADLJST__LEFT_JUSTIFIED  0x04 ///< Data in the ADC0H:ADC0L registers is left-      
                                            ///< justified.                                      
                                                                                                 
#define ADC0CF_ADSC__FMASK             0xF8 ///< SAR Clock Divider                               
#define ADC0CF_ADSC__SHIFT             0x03 ///< SAR Clock Divider                               
                                                                                                 
//------------------------------------------------------------------------------
// ADC0CN Enums (ADC0 Control @ 0xE8)
//------------------------------------------------------------------------------
#define ADC0CN_ADCM__FMASK         0x07 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__SHIFT         0x00 ///< Start of Conversion Mode Select                   
#define ADC0CN_ADCM__ADBUSY        0x00 ///< ADC0 conversion initiated on write of 1 to ADBUSY.
#define ADC0CN_ADCM__TIMER0        0x01 ///< ADC0 conversion initiated on overflow of Timer 0. 
#define ADC0CN_ADCM__TIMER2        0x02 ///< ADC0 conversion initiated on overflow of Timer 2. 
#define ADC0CN_ADCM__TIMER1        0x03 ///< ADC0 conversion initiated on overflow of Timer 1. 
#define ADC0CN_ADCM__CNVSTR        0x04 ///< ADC0 conversion initiated on rising edge of       
                                        ///< CNVSTR.                                           
                                                                                               
#define ADC0CN_ADWINT__BMASK       0x08 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__SHIFT       0x03 ///< Window Compare Interrupt Flag                     
#define ADC0CN_ADWINT__NOT_SET     0x00 ///< An ADC window compare event did not occur.        
#define ADC0CN_ADWINT__SET         0x08 ///< An ADC window compare event occurred.             
                                                                                               
#define ADC0CN_ADBUSY__BMASK       0x10 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__SHIFT       0x04 ///< ADC Busy                                          
#define ADC0CN_ADBUSY__NOT_SET     0x00 ///< An ADC0 conversion is not currently in progress.  
#define ADC0CN_ADBUSY__SET         0x10 ///< ADC0 conversion is in progress or start an ADC0   
                                        ///< conversion.                                       
                                                                                               
#define ADC0CN_ADINT__BMASK        0x20 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__SHIFT        0x05 ///< Conversion Complete Interrupt Flag                
#define ADC0CN_ADINT__NOT_SET      0x00 ///< ADC0 has not completed a conversion since the last
                                        ///< time ADINT was cleared.                           
#define ADC0CN_ADINT__SET          0x20 ///< ADC0 completed a data conversion.                 
                                                                                               
#define ADC0CN_ADTM__BMASK         0x40 ///< Track Mode                                        
#define ADC0CN_ADTM__SHIFT         0x06 ///< Track Mode                                        
#define ADC0CN_ADTM__TRACK_NORMAL  0x00 ///< Normal Track Mode. When ADC0 is enabled,          
                                        ///< conversion begins immediately following the start-
                                        ///< of-conversion signal.                             
#define ADC0CN_ADTM__TRACK_DELAYED 0x40 ///< Delayed Track Mode. When ADC0 is enabled,         
                                        ///< conversion begins 3 SAR clock cycles following the
                                        ///< start-of-conversion signal. The ADC is allowed to 
                                        ///< track during this time. Note that there is not a  
                                        ///< tracking delay when the external conversion start 
                                        ///< (CNVSTR) is used as the start-of-conversion       
                                        ///< source.                                           
                                                                                               
#define ADC0CN_ADEN__BMASK         0x80 ///< ADC Enable                                        
#define ADC0CN_ADEN__SHIFT         0x07 ///< ADC Enable                                        
#define ADC0CN_ADEN__DISABLED      0x00 ///< ADC0 Disabled (low-power shutdown).               
#define ADC0CN_ADEN__ENABLED       0x80 ///< ADC0 Enabled (active and ready for data           
                                        ///< conversions).                                     
                                                                                               
//------------------------------------------------------------------------------
// ADC0GTH Enums (ADC0 Greater-Than High Byte @ 0xC4)
//------------------------------------------------------------------------------
#define ADC0GTH_ADC0GTH__FMASK 0xFF ///< Greater-Than High Byte
#define ADC0GTH_ADC0GTH__SHIFT 0x00 ///< Greater-Than High Byte
                                                               
//------------------------------------------------------------------------------
// ADC0GTL Enums (ADC0 Greater-Than Low Byte @ 0xC3)
//------------------------------------------------------------------------------
#define ADC0GTL_ADC0GTL__FMASK 0xFF ///< Greater-Than Low Byte
#define ADC0GTL_ADC0GTL__SHIFT 0x00 ///< Greater-Than Low Byte
                                                              
//------------------------------------------------------------------------------
// ADC0H Enums (ADC0 Data Word High Byte @ 0xBE)
//------------------------------------------------------------------------------
#define ADC0H_ADC0H__FMASK 0xFF ///< Data Word High Byte
#define ADC0H_ADC0H__SHIFT 0x00 ///< Data Word High Byte
                                                        
//------------------------------------------------------------------------------
// ADC0L Enums (ADC0 Data Word Low Byte @ 0xBD)
//------------------------------------------------------------------------------
#define ADC0L_ADC0L__FMASK 0xFF ///< Data Word Low Byte
#define ADC0L_ADC0L__SHIFT 0x00 ///< Data Word Low Byte
                                                       
//------------------------------------------------------------------------------
// ADC0LTH Enums (ADC0 Less-Than High Byte @ 0xC6)
//------------------------------------------------------------------------------
#define ADC0LTH_ADC0LTH__FMASK 0xFF ///< Less-Than High Byte
#define ADC0LTH_ADC0LTH__SHIFT 0x00 ///< Less-Than High Byte
                                                            
//------------------------------------------------------------------------------
// ADC0LTL Enums (ADC0 Less-Than Low Byte @ 0xC5)
//------------------------------------------------------------------------------
#define ADC0LTL_ADC0LTL__FMASK 0xFF ///< Less-Than Low Byte
#define ADC0LTL_ADC0LTL__SHIFT 0x00 ///< Less-Than Low Byte
                                                           
//------------------------------------------------------------------------------
// ADC0MX Enums (ADC0 Multiplexer Selection @ 0xBB)
//------------------------------------------------------------------------------
#define ADC0MX_ADC0MX__FMASK   0x1F ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__SHIFT   0x00 ///< AMUX0 Positive Input Selection
#define ADC0MX_ADC0MX__ADC0P0  0x00 ///< Select ADC0P.0.               
#define ADC0MX_ADC0MX__ADC0P1  0x01 ///< Select ADC0P.1.               
#define ADC0MX_ADC0MX__ADC0P2  0x02 ///< Select ADC0P.2.               
#define ADC0MX_ADC0MX__ADC0P3  0x03 ///< Select ADC0P.3.               
#define ADC0MX_ADC0MX__ADC0P4  0x04 ///< Select ADC0P.4.               
#define ADC0MX_ADC0MX__ADC0P5  0x05 ///< Select ADC0P.5.               
#define ADC0MX_ADC0MX__ADC0P6  0x06 ///< Select ADC0P.6.               
#define ADC0MX_ADC0MX__ADC0P7  0x07 ///< Select ADC0P.7.               
#define ADC0MX_ADC0MX__ADC0P8  0x08 ///< Select ADC0P.8.               
#define ADC0MX_ADC0MX__ADC0P9  0x09 ///< Select ADC0P.9.               
#define ADC0MX_ADC0MX__ADC0P10 0x0A ///< Select ADC0P.10.              
#define ADC0MX_ADC0MX__ADC0P11 0x0B ///< Select ADC0P.11.              
#define ADC0MX_ADC0MX__ADC0P12 0x0C ///< Select ADC0P.12.              
#define ADC0MX_ADC0MX__ADC0P13 0x0D ///< Select ADC0P.13.              
#define ADC0MX_ADC0MX__ADC0P14 0x0E ///< Select ADC0P.14.              
#define ADC0MX_ADC0MX__ADC0P15 0x0F ///< Select ADC0P.15.              
#define ADC0MX_ADC0MX__TEMP    0x10 ///< Temperature sensor.           
#define ADC0MX_ADC0MX__LDO     0x11 ///< Internal LDO regulator output.
#define ADC0MX_ADC0MX__VDD     0x12 ///< VDD.                          
#define ADC0MX_ADC0MX__GND     0x13 ///< GND.                          
#define ADC0MX_ADC0MX__NONE    0x1F ///< No input selected.            
                                                                       
//------------------------------------------------------------------------------
// ACC Enums (Accumulator @ 0xE0)
//------------------------------------------------------------------------------
#define ACC_ACC__FMASK 0xFF ///< Accumulator
#define ACC_ACC__SHIFT 0x00 ///< Accumulator
                                            
//------------------------------------------------------------------------------
// B Enums (B Register @ 0xF0)
//------------------------------------------------------------------------------
#define B_B__FMASK 0xFF ///< B Register
#define B_B__SHIFT 0x00 ///< B Register
                                       
//------------------------------------------------------------------------------
// DPH Enums (Data Pointer High @ 0x83)
//------------------------------------------------------------------------------
#define DPH_DPH__FMASK 0xFF ///< Data Pointer High
#define DPH_DPH__SHIFT 0x00 ///< Data Pointer High
                                                  
//------------------------------------------------------------------------------
// DPL Enums (Data Pointer Low @ 0x82)
//------------------------------------------------------------------------------
#define DPL_DPL__FMASK 0xFF ///< Data Pointer Low
#define DPL_DPL__SHIFT 0x00 ///< Data Pointer Low
                                                 
//------------------------------------------------------------------------------
// PSW Enums (Program Status Word @ 0xD0)
//------------------------------------------------------------------------------
#define PSW_PARITY__BMASK   0x01 ///< Parity Flag                                       
#define PSW_PARITY__SHIFT   0x00 ///< Parity Flag                                       
#define PSW_PARITY__NOT_SET 0x00 ///< The sum of the 8 bits in the accumulator is even. 
#define PSW_PARITY__SET     0x01 ///< The sum of the 8 bits in the accumulator is odd.  
                                                                                        
#define PSW_F1__BMASK       0x02 ///< User Flag 1                                       
#define PSW_F1__SHIFT       0x01 ///< User Flag 1                                       
#define PSW_F1__NOT_SET     0x00 ///< Flag is not set.                                  
#define PSW_F1__SET         0x02 ///< Flag is set.                                      
                                                                                        
