ahtn/keyplus/efm8/efm8/mcu/C8051F800/inc/SI_C8051F800_Register_Enums.h
#define CS0CF_CS0CM__FMASK                0x70 ///< CS0 Start of Conversion Mode Select               
#define CS0CF_CS0CM__SHIFT                0x04 ///< CS0 Start of Conversion Mode Select               
#define CS0CF_CS0CM__CS0BUSY              0x00 ///< Conversion initiated on every write of 1 to       
                                               ///< CS0BUSY.                                          
#define CS0CF_CS0CM__TIMER0               0x10 ///< Conversion initiated on overflow of Timer 0.      
#define CS0CF_CS0CM__TIMER2               0x20 ///< Conversion initiated on overflow of Timer 2.      
#define CS0CF_CS0CM__TIMER1               0x30 ///< Conversion initiated on overflow of Timer 1.      
#define CS0CF_CS0CM__SINGLE_CONTINUOUS    0x60 ///< Conversion initiated continuously on the channel  
                                               ///< selected by CS0MX after writing 1 to CS0BUSY.     
#define CS0CF_CS0CM__AUTO_SCAN            0x70 ///< The converter enters Auto Scan Mode and           
                                               ///< continuously scans on channels from CS0SS to CS0SE
                                               ///< after firmware writes 1 to CS0BUSY.               
                                                                                                      
#define CS0CF_CS0SMEN__BMASK              0x80 ///< CS0 Channel Scan Masking Enable                   
#define CS0CF_CS0SMEN__SHIFT              0x07 ///< CS0 Channel Scan Masking Enable                   
#define CS0CF_CS0SMEN__SCAN_MASK_DISABLED 0x00 ///< The CS0SCAN0 and CS0SCAN1 register contents are   
                                               ///< ignored.                                          
#define CS0CF_CS0SMEN__SCAN_MASK_ENABLED  0x80 ///< The CS0SCAN0 and CS0SCAN1 registers determine     
                                               ///< which channels will be included in the scan.      
                                                                                                      
//------------------------------------------------------------------------------
// CS0CN Enums (Capacitive Sense 0 Control @ 0xB0)
//------------------------------------------------------------------------------
#define CS0CN_CSCMPF__BMASK     0x01 ///< CS0 Digital Comparator Interrupt Flag             
#define CS0CN_CSCMPF__SHIFT     0x00 ///< CS0 Digital Comparator Interrupt Flag             
#define CS0CN_CSCMPF__NOT_SET   0x00 ///< CS0 result is smaller than the value set by CS0THH
                                     ///< and CS0THL since the last time CS0CMPF was        
                                     ///< cleared.                                          
#define CS0CN_CSCMPF__SET       0x01 ///< CS0 result is greater than the value set by CS0THH
                                     ///< and CS0THL since the last time CS0CMPF was        
                                     ///< cleared.                                          
                                                                                            
#define CS0CN_CSCMPEN__BMASK    0x08 ///< CS0 Digital Comparator Enable                     
#define CS0CN_CSCMPEN__SHIFT    0x03 ///< CS0 Digital Comparator Enable                     
#define CS0CN_CSCMPEN__DISABLED 0x00 ///< Disable CS0 digital comparator.                   
#define CS0CN_CSCMPEN__ENABLED  0x08 ///< Enable CS0 digital comparator.                    
                                                                                            
#define CS0CN_CSBUSY__BMASK     0x10 ///< CS0 Busy                                          
#define CS0CN_CSBUSY__SHIFT     0x04 ///< CS0 Busy                                          
#define CS0CN_CSBUSY__NOT_SET   0x00 ///< A CS0 conversion is not currently in progress.    
#define CS0CN_CSBUSY__SET       0x10 ///< CS0 conversion is in progress or start a CS0      
                                     ///< conversion.                                       
                                                                                            
#define CS0CN_CSINT__BMASK      0x20 ///< CS0 Interrupt Flag                                
#define CS0CN_CSINT__SHIFT      0x05 ///< CS0 Interrupt Flag                                
#define CS0CN_CSINT__NOT_SET    0x00 ///< CS0 has not completed a data conversion since the 
                                     ///< last time CS0INT was cleared.                     
#define CS0CN_CSINT__SET        0x20 ///< CS0 has completed a data conversion.              
                                                                                            
#define CS0CN_CSEN__BMASK       0x80 ///< CS0 Enable                                        
#define CS0CN_CSEN__SHIFT       0x07 ///< CS0 Enable                                        
#define CS0CN_CSEN__DISABLED    0x00 ///< CS0 disabled and in low-power mode.               
#define CS0CN_CSEN__ENABLED     0x80 ///< CS0 enabled and ready to convert.                 
                                                                                            
//------------------------------------------------------------------------------
// CS0DH Enums (Capacitive Sense 0 Data High Byte @ 0xAC)
//------------------------------------------------------------------------------
#define CS0DH_CS0DH__FMASK 0xFF ///< CS0 Data High Byte
#define CS0DH_CS0DH__SHIFT 0x00 ///< CS0 Data High Byte
                                                       
//------------------------------------------------------------------------------
// CS0DL Enums (Capacitive Sense 0 Data Low Byte @ 0xAB)
//------------------------------------------------------------------------------
#define CS0DL_CS0DL__FMASK 0xFF ///< CS0 Data Low Byte
#define CS0DL_CS0DL__SHIFT 0x00 ///< CS0 Data Low Byte
                                                      
//------------------------------------------------------------------------------
// CS0MX Enums (Capacitive Sense 0 Mux Channel Select @ 0x9C)
//------------------------------------------------------------------------------
#define CS0MX_CS0MX__FMASK        0x0F ///< CS0 Mux Channel Select                 
#define CS0MX_CS0MX__SHIFT        0x00 ///< CS0 Mux Channel Select                 
#define CS0MX_CS0MX__CS0P0        0x00 ///< Select CS0.0.                          
#define CS0MX_CS0MX__CS0P1        0x01 ///< Select CS0.1.                          
#define CS0MX_CS0MX__CS0P2        0x02 ///< Select CS0.2.                          
#define CS0MX_CS0MX__CS0P3        0x03 ///< Select CS0.3.                          
#define CS0MX_CS0MX__CS0P4        0x04 ///< Select CS0.4.                          
#define CS0MX_CS0MX__CS0P5        0x05 ///< Select CS0.5.                          
#define CS0MX_CS0MX__CS0P6        0x06 ///< Select CS0.6.                          
#define CS0MX_CS0MX__CS0P7        0x07 ///< Select CS0.7.                          
#define CS0MX_CS0MX__CS0P8        0x08 ///< Select CS0.8.                          
#define CS0MX_CS0MX__CS0P9        0x09 ///< Select CS0.9.                          
#define CS0MX_CS0MX__CS0P10       0x0A ///< Select CS0.10.                         
#define CS0MX_CS0MX__CS0P11       0x0B ///< Select CS0.11.                         
#define CS0MX_CS0MX__CS0P12       0x0C ///< Select CS0.12.                         
#define CS0MX_CS0MX__CS0P13       0x0D ///< Select CS0.13.                         
#define CS0MX_CS0MX__CS0P14       0x0E ///< Select CS0.14.                         
#define CS0MX_CS0MX__CS0P15       0x0F ///< Select CS0.15.                         
                                                                                   
#define CS0MX_CS0UC__BMASK        0x80 ///< CS0 Unconnected                        
#define CS0MX_CS0UC__SHIFT        0x07 ///< CS0 Unconnected                        
#define CS0MX_CS0UC__CONNECTED    0x00 ///< CS0 is connected to the port pins.     
#define CS0MX_CS0UC__DISCONNECTED 0x80 ///< CS0 is disconnected from the port pins.
                                                                                   
//------------------------------------------------------------------------------
// CS0SE Enums (Capacitive Sense 0 Auto Scan End Channel @ 0xBA)
//------------------------------------------------------------------------------
#define CS0SE_CS0SE__FMASK 0x1F ///< Ending Channel for Auto Scan
#define CS0SE_CS0SE__SHIFT 0x00 ///< Ending Channel for Auto Scan
                                                                 
//------------------------------------------------------------------------------
// CS0SS Enums (Capacitive Sense 0 Auto Scan Start Channel @ 0xB9)
//------------------------------------------------------------------------------
#define CS0SS_CS0SS__FMASK 0x1F ///< Starting Channel for Auto Scan
#define CS0SS_CS0SS__SHIFT 0x00 ///< Starting Channel for Auto Scan
                                                                   
//------------------------------------------------------------------------------
// CS0THH Enums (Capacitive Sense 0 Comparator Threshold High Byte @ 0x97)
//------------------------------------------------------------------------------
#define CS0THH_CS0THH__FMASK 0xFF ///< CS0 Comparator Threshold High Byte
#define CS0THH_CS0THH__SHIFT 0x00 ///< CS0 Comparator Threshold High Byte
                                                                         
//------------------------------------------------------------------------------
// CS0THL Enums (Capacitive Sense 0 Comparator Threshold Low Byte @ 0x96)
//------------------------------------------------------------------------------
#define CS0THL_CS0THL__FMASK 0xFF ///< CS0 Comparator Threshold Low Byte
#define CS0THL_CS0THL__SHIFT 0x00 ///< CS0 Comparator Threshold Low Byte
                                                                        
//------------------------------------------------------------------------------
// DERIVID Enums (Derivative Identification @ 0xAD)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK        0xFF ///< Derivative ID
#define DERIVID_DERIVID__SHIFT        0x00 ///< Derivative ID
#define DERIVID_DERIVID__C8051F800    0xD0 ///< C8051F800    
#define DERIVID_DERIVID__C8051F801    0xD1 ///< C8051F801    
#define DERIVID_DERIVID__C8051F802    0xD2 ///< C8051F802    
#define DERIVID_DERIVID__C8051F803    0xD3 ///< C8051F803    
#define DERIVID_DERIVID__C8051F804    0xD4 ///< C8051F804    
#define DERIVID_DERIVID__C8051F805    0xD5 ///< C8051F805    
#define DERIVID_DERIVID__C8051F806    0xD6 ///< C8051F806    
#define DERIVID_DERIVID__C8051F807    0xD7 ///< C8051F807    
#define DERIVID_DERIVID__C8051F808    0xD8 ///< C8051F808    
#define DERIVID_DERIVID__C8051F809    0xD9 ///< C8051F809    
#define DERIVID_DERIVID__C8051F810    0xDA ///< C8051F810    
#define DERIVID_DERIVID__C8051F811    0xDB ///< C8051F811    
#define DERIVID_DERIVID__C8051F812    0xDC ///< C8051F812    
#define DERIVID_DERIVID__C8051F813    0xDD ///< C8051F813    
#define DERIVID_DERIVID__C8051F814    0xDE ///< C8051F814    
#define DERIVID_DERIVID__C8051F815    0xDF ///< C8051F815    
#define DERIVID_DERIVID__C8051F816    0xE0 ///< C8051F816    
#define DERIVID_DERIVID__C8051F817    0xE1 ///< C8051F817    
#define DERIVID_DERIVID__C8051F818    0xE2 ///< C8051F818    
#define DERIVID_DERIVID__C8051F819    0xE3 ///< C8051F819    
#define DERIVID_DERIVID__C8051F820    0xE4 ///< C8051F820    
#define DERIVID_DERIVID__C8051F821    0xE5 ///< C8051F821    
#define DERIVID_DERIVID__C8051F822    0xE6 ///< C8051F822    
#define DERIVID_DERIVID__C8051F823    0xE7 ///< C8051F823    
#define DERIVID_DERIVID__C8051F824    0xE8 ///< C8051F824    
#define DERIVID_DERIVID__C8051F825    0xE9 ///< C8051F825    
#define DERIVID_DERIVID__C8051F826    0xEA ///< C8051F826    
#define DERIVID_DERIVID__C8051F827    0xEB ///< C8051F827    
#define DERIVID_DERIVID__C8051F828    0xEC ///< C8051F828    
#define DERIVID_DERIVID__C8051F829    0xED ///< C8051F829    
#define DERIVID_DERIVID__C8051F830    0xEE ///< C8051F830    
#define DERIVID_DERIVID__C8051F831    0xEF ///< C8051F831    
#define DERIVID_DERIVID__C8051F832    0xF0 ///< C8051F832    
#define DERIVID_DERIVID__C8051F833    0xF1 ///< C8051F833    
#define DERIVID_DERIVID__C8051F834    0xF2 ///< C8051F834    
#define DERIVID_DERIVID__C8051F835    0xF3 ///< C8051F835    
#define DERIVID_DERIVID__C8051F854_GM 0xF4 ///< C8051F854-GM 
#define DERIVID_DERIVID__C8051F855_GM 0xF5 ///< C8051F855-GM 
                                                             
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xB5)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xB6)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A 
#define REVID_REVID__REV_B 0x01 ///< Revision B 
#define REVID_REVID__REV_C 0x02 ///< Revision C 
                                                
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
